tests/data/ycsb-time-series.dat
2022-10-01 01:23:57:917 0 sec: 0 operations; est completion in 0 second
2022-10-01 01:24:07:902 10 sec: 21029 operations; 2102.9 current ops/sec; est completion in 5 days 12 hours [READ AverageLatency(us)=22779.72]
2022-10-01 01:24:17:902 20 sec: 45974 operations; 2494.5 current ops/sec; est completion in 5 days [READ AverageLatency(us)=21093.79]
2022-10-01 01:24:27:902 30 sec: 70942 operations; 2496.8 current ops/sec; est completion in 4 days 21 hours [READ AverageLatency(us)=17638.34]
2022-10-01 01:24:37:902 40 sec: 96038 operations; 2509.6 current ops/sec; est completion in 4 days 19 hours [READ AverageLatency(us)=22447.92]
2022-10-01 01:24:47:902 50 sec: 120910 operations; 2487.2 current ops/sec; est completion in 4 days 18 hours [READ AverageLatency(us)=19622.87]
2022-10-01 01:24:57:902 60 sec: 146042 operations; 2513.2 current ops/sec; est completion in 4 days 18 hours [READ AverageLatency(us)=14863.78]
2022-10-01 01:24:57:997 60 sec: 146134 operations; 978.72 current ops/sec; est completion in 4 days 18 hours [READ AverageLatency(us)=7788.22] [CLEANUP AverageLatency(us)=72.19]
[OVERALL], RunTime(ms), 60093
[OVERALL], Throughput(ops/sec), 2431.7973807265407
[TOTAL_GCS_PS_Scavenge], Count, 16
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 104
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.17306508245552726
[TOTAL_GCS_PS_MarkSweep], Count, 2
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 52
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.08653254122776363
[TOTAL_GCs], Count, 18
[TOTAL_GC_TIME], Time(ms), 156
[TOTAL_GC_TIME_%], Time(%), 0.2595976236832909
[READ], Operations, 146134
[READ], AverageLatency(us), 19648.40244570052
[READ], MinLatency(us), 2419
[READ], MaxLatency(us), 926968
[READ], Return=OK, 146134
[READ], 0, 42307.65222970805
[READ], 1000, 25891.854741896757
[READ], 2000, 22558.006075334142
[READ], 3000, 19565.929796569606
[READ], 4000, 14591.428852975956
[READ], 5000, 16380.601777059774
[READ], 6000, 20572.916465863455
[READ], 7000, 17695.34032449545
[READ], 8000, 12106.920532472772
[READ], 9000, 13669.89244760775
[READ], 10000, 15021.342295345105
[READ], 11000, 20345.75170204245
[READ], 12000, 20804.036348949918
[READ], 13000, 31959.07740686986
[READ], 14000, 44360.403739612186
[READ], 15000, 19838.39495145631
[READ], 16000, 15042.471107544141
[READ], 17000, 14904.455489021957
[READ], 18000, 10872.696848823294
[READ], 19000, 13736.977991196478
[READ], 20000, 15973.014016820183
[READ], 21000, 17668.569322709165
[READ], 22000, 16865.471417069242
[READ], 23000, 11306.913763066203
[READ], 24000, 32364.298769116
[READ], 25000, 15075.527027027027